results/bun/h3.txt
Bundle: 30.7 KB
Startup: 52.8 ms
Memory before: 67.5 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     77729.78    5451.84   87889.60
  Latency        6.44ms   821.07us    47.92ms
  HTTP codes:
    1xx - 0, 2xx - 775106, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    12.19MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     66504.15    7368.27   73762.56
  Latency        7.52ms     0.87ms    32.58ms
  HTTP codes:
    1xx - 0, 2xx - 664226, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.04MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     52448.40   16574.56   67873.95
  Latency        9.53ms     3.90ms   106.17ms
  HTTP codes:
    1xx - 0, 2xx - 523352, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    14.11MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       153.61      27.93     561.05
  Latency       64.86ms    10.83ms   161.02ms
  HTTP codes:
    1xx - 0, 2xx - 1546, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     2.03GB/s

Memory after: 104.0 MB