results/bun/hono.txt
Bundle: 21.4 KB
Startup: 66.8 ms
Memory before: 48.4 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     84830.79    7424.50   97782.26
  Latency        5.90ms   483.77us    31.55ms
  HTTP codes:
    1xx - 0, 2xx - 846933, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    14.45MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     62263.52    3824.76   66665.75
  Latency        8.04ms     0.92ms    69.64ms
  HTTP codes:
    1xx - 0, 2xx - 620177, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    13.06MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     55794.96    2728.88   59100.95
  Latency        8.96ms   465.97us    36.86ms
  HTTP codes:
    1xx - 0, 2xx - 557327, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    14.28MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       544.92      88.51     799.52
  Latency       18.34ms     5.65ms    73.01ms
  HTTP codes:
    1xx - 0, 2xx - 5452, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.18GB/s

Memory after: 75.6 MB